In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
con = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Par change

In [2]:
name = 'TQM'
old_par= 1.00
new_par = 0.50
ratio = 2
effective_date = '2022-01-13'

### Price table

In [4]:
sql = '''
SELECT *
FROM price
WHERE name = '%s'
'''
sql = sql % (name)
price = pd.read_sql(sql, con)
price.shape

(1692, 7)

In [5]:
sql = '''
UPDATE price
SET price = price/%s, maxp=maxp/%s, minp=minp/%s, qty=qty*%s, opnp=opnp/%s
WHERE name = '%s' AND date < '%s'
'''
sql = sql % (ratio, ratio, ratio, ratio, ratio, name, effective_date)
print(sql)

UPDATE price
SET price = price/3, maxp=maxp/3, minp=minp/3, qty=qty*3, opnp=opnp/3
WHERE name = 'NOBLE' AND date < '2021-01-07'

In [6]:
rp = con.execute(sql)
rp.rowcount

1692

### Buy table

In [7]:
sql = '''
SELECT *
FROM buy
WHERE name = '%s'
'''
sql = sql % (name)
price = pd.read_sql(sql, con)
price.shape

(0, 10)

### Dividend table

In [8]:
sql = '''
SELECT *
FROM dividend
WHERE name = '%s'
'''
sql = sql % (name)
price = pd.read_sql(sql, con)
price

,NAME,Q4,Q3,Q2,Q1,DIVIDEND,PRICE,PERCENT,SHARES,XDATE,PAIDDATE,KIND,ACTUAL
0,NOBLE,0.76,0.0,1.1,0.0,1.86,0.0,0.0,0.0,2020-08-27,2020-09-09,,1

In [9]:
sql = '''
UPDATE dividend
SET Q4 = Q4/%s, Q3 = Q3/%s, Q2 = Q2/%s, Q1 = Q1/%s, DIVIDEND=DIVIDEND/%s
WHERE name = '%s'
'''
sql = sql % (ratio, ratio, ratio, ratio, ratio,  name)
print(sql)

UPDATE dividend
SET Q4 = Q4/3, Q3 = Q3/3, Q2 = Q2/3, Q1 = Q1/3, DIVIDEND=DIVIDEND/3
WHERE name = 'NOBLE'

In [10]:
rp = con.execute(sql)
rp.rowcount

1

### EPSS table

In [12]:
sql = '''
SELECT *
FROM epss
WHERE name = '%s'
'''
sql = sql % (name)
epss = pd.read_sql(sql, conlt)
epss.shape

(21, 14)

In [13]:
sql = '''
UPDATE epss
SET q_eps = q_eps/%s, y_eps = y_eps/%s, aq_eps = aq_eps/%s, ay_eps = ay_eps/%s
WHERE name = '%s' AND year < 2021 
'''
sql = sql % (ratio, ratio, ratio, ratio, name)
print(sql)

UPDATE epss
SET q_eps = q_eps/3, y_eps = y_eps/3, aq_eps = aq_eps/3, ay_eps = ay_eps/3
WHERE name = 'NOBLE' AND year < 2021

In [14]:
rp = conlt.execute(sql)
rp.rowcount

21

In [15]:
rp = conpg.execute(sql)
rp.rowcount

21

### CONSENSUS table

In [16]:
sql = '''
SELECT *
FROM consensus
WHERE name = '%s'
'''
sql = sql % (name)
epss = pd.read_sql(sql, conlt)
epss.columns

Index(['id', 'name', 'price', 'buy', 'hold', 'sell', 'eps_a', 'eps_b', 'pe',
       'pbv', 'yield', 'target_price', 'status', 'ticker_id', 'created_at',
       'updated_at'],
      dtype='object')

In [17]:
sql = '''
UPDATE consensus
SET price = price/%s, eps_a = eps_a/%s, eps_b = eps_b/%s, target_price = target_price/%s
WHERE name = '%s'
'''
sql = sql % (ratio, ratio, ratio, ratio, name)
print(sql)

UPDATE consensus
SET price = price/3, eps_a = eps_a/3, eps_b = eps_b/3, target_price = target_price/3
WHERE name = 'NOBLE'

In [18]:
rp = conlt.execute(sql)
rp.rowcount

1

In [19]:
rp = conmy.execute(sql)
rp.rowcount

1

In [20]:
rp = conpg.execute(sql)
rp.rowcount

1

### Portfolio database

In [25]:
sql = '''
SELECT *
FROM buys JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s'
'''
sql = sql % (name)
buys = pd.read_sql(sql, conpf)
buys

,id,stock_id,date,qty,price,fee,vat,status,net,kind,chart,id,name,category_id,website
0,657,145,2019-11-20,18000,5.31,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
1,663,145,2019-12-09,18000,5.31,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
2,665,145,2019-12-24,18000,5.31,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
3,668,145,2020-01-06,18000,5.31,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
4,694,145,2019-11-20,4500,5.40,50.30,3.52,Sold,24353.82,DTD,None,145,NOBLE,3,
5,719,145,2020-05-22,18000,5.31,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,

In [22]:
sql = '''
UPDATE buys
SET price = price/%s, qty = qty*%s
WHERE stock_id = 145
'''
sql = sql % (ratio, ratio)
print(sql)

UPDATE buys
SET price = price/3, qty = qty*3
WHERE stock_id = 145

In [23]:
rp = conpf.execute(sql)
rp.rowcount

6

In [33]:
sql = '''
SELECT *
FROM sells LIMIT 1'''
df_tmp = pd.read_sql(sql, conpf)
df_tmp.columns

Index(['id', 'buy_id', 'date', 'price', 'fee', 'vat', 'net', 'days', 'profit',
       'percent', 'yearly', 'sequence', 'chart'],
      dtype='object')

In [31]:
sql = '''
SELECT *
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s'
'''
sql = sql % (name)
sells = pd.read_sql(sql, conpf)
sells

,id,buy_id,date,price,fee,vat,net,days,profit,percent,...,fee,vat,status,net,kind,chart,id,name,category_id,website
0,547,694,2020-04-10,14.0,43.47,3.04,20953.49,142,-3400.33,-13.96220,...,50.30,3.52,Sold,24353.82,DTD,None,145,NOBLE,3,
1,627,719,2020-10-19,18.2,226.04,15.82,108958.14,150,13106.31,13.67351,...,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
2,628,668,2020-10-19,18.2,226.04,15.82,108958.14,287,13106.31,13.67351,...,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
3,629,665,2020-10-19,18.2,226.04,15.82,108958.14,300,13106.31,13.67351,...,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
4,630,663,2020-10-19,18.2,226.04,15.82,108958.14,315,13106.31,13.67351,...,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,
5,631,657,2020-10-19,18.2,226.04,15.82,108958.14,334,13106.31,13.67351,...,197.97,13.86,Sold,95851.83,DTD,None,145,NOBLE,3,

In [36]:
sql = '''
UPDATE sells
SET price = price/%s
WHERE buy_id IN (694, 719, 668, 665, 663, 657)
'''
sql = sql % (ratio)
print(sql)

UPDATE sells
SET price = price/3
WHERE buy_id IN (694, 719, 668, 665, 663, 657)

In [37]:
rp = conpf.execute(sql)
rp.rowcount

6

### End of Process